modm-ext/archive-stmicro-svd/header_stm32h747xg.svd
      <register>
        <name>OCOLR</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE_4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>GREEN_4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>GREEN_3</name>
            <bitOffset>5</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>RED_4</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>RED_3</name>
            <bitOffset>10</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>RED_2</name>
            <bitOffset>11</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA_4</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ALPHA_3</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RED_1</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA_1</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OMAR</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OOR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LO</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>NLR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>NL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>PL</name>
            <bitOffset>16</bitOffset>
            <bitWidth>14</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>LWR</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LW</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AMTCR</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DT</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.0</name>
        <addressOffset>0x400</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.1</name>
        <addressOffset>0x404</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.2</name>
        <addressOffset>0x408</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.3</name>
        <addressOffset>0x40c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.4</name>
        <addressOffset>0x410</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.5</name>
        <addressOffset>0x414</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.6</name>
        <addressOffset>0x418</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.7</name>
        <addressOffset>0x41c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.8</name>
        <addressOffset>0x420</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.9</name>
        <addressOffset>0x424</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.10</name>
        <addressOffset>0x428</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.11</name>
        <addressOffset>0x42c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.12</name>
        <addressOffset>0x430</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.13</name>
        <addressOffset>0x434</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.14</name>
        <addressOffset>0x438</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.15</name>
        <addressOffset>0x43c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.16</name>
        <addressOffset>0x440</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.17</name>
        <addressOffset>0x444</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.18</name>
        <addressOffset>0x448</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.19</name>
        <addressOffset>0x44c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.20</name>
        <addressOffset>0x450</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.21</name>
        <addressOffset>0x454</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.22</name>
        <addressOffset>0x458</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.23</name>
        <addressOffset>0x45c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.24</name>
        <addressOffset>0x460</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.25</name>
        <addressOffset>0x464</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.26</name>
        <addressOffset>0x468</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.27</name>
        <addressOffset>0x46c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.28</name>
        <addressOffset>0x470</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.29</name>
        <addressOffset>0x474</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.30</name>
        <addressOffset>0x478</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.31</name>
        <addressOffset>0x47c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.32</name>
        <addressOffset>0x480</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.33</name>
        <addressOffset>0x484</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.34</name>
        <addressOffset>0x488</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.35</name>
        <addressOffset>0x48c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.36</name>
        <addressOffset>0x490</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.37</name>
        <addressOffset>0x494</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.38</name>
        <addressOffset>0x498</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.39</name>
        <addressOffset>0x49c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.40</name>
        <addressOffset>0x4a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.41</name>
        <addressOffset>0x4a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.42</name>
        <addressOffset>0x4a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.43</name>
        <addressOffset>0x4ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.44</name>
        <addressOffset>0x4b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.45</name>
        <addressOffset>0x4b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.46</name>
        <addressOffset>0x4b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.47</name>
        <addressOffset>0x4bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.48</name>
        <addressOffset>0x4c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.49</name>
        <addressOffset>0x4c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.50</name>
        <addressOffset>0x4c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.51</name>
        <addressOffset>0x4cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.52</name>
        <addressOffset>0x4d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.53</name>
        <addressOffset>0x4d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.54</name>
        <addressOffset>0x4d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.55</name>
        <addressOffset>0x4dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.56</name>
        <addressOffset>0x4e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.57</name>
        <addressOffset>0x4e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.58</name>
        <addressOffset>0x4e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.59</name>
        <addressOffset>0x4ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.60</name>
        <addressOffset>0x4f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.61</name>
        <addressOffset>0x4f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.62</name>
        <addressOffset>0x4f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.63</name>
        <addressOffset>0x4fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.64</name>
        <addressOffset>0x500</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.65</name>
        <addressOffset>0x504</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.66</name>
        <addressOffset>0x508</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.67</name>
        <addressOffset>0x50c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.68</name>
        <addressOffset>0x510</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.69</name>
        <addressOffset>0x514</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.70</name>
        <addressOffset>0x518</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.71</name>
        <addressOffset>0x51c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.72</name>
        <addressOffset>0x520</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.73</name>
        <addressOffset>0x524</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.74</name>
        <addressOffset>0x528</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.75</name>
        <addressOffset>0x52c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.76</name>
        <addressOffset>0x530</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.77</name>
        <addressOffset>0x534</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.78</name>
        <addressOffset>0x538</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.79</name>
        <addressOffset>0x53c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.80</name>
        <addressOffset>0x540</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.81</name>
        <addressOffset>0x544</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.82</name>
        <addressOffset>0x548</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.83</name>
        <addressOffset>0x54c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.84</name>
        <addressOffset>0x550</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.85</name>
        <addressOffset>0x554</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.86</name>
        <addressOffset>0x558</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.87</name>
        <addressOffset>0x55c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.88</name>
        <addressOffset>0x560</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.89</name>
        <addressOffset>0x564</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.90</name>
        <addressOffset>0x568</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.91</name>
        <addressOffset>0x56c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.92</name>
        <addressOffset>0x570</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.93</name>
        <addressOffset>0x574</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.94</name>
        <addressOffset>0x578</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.95</name>
        <addressOffset>0x57c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.96</name>
        <addressOffset>0x580</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.97</name>
        <addressOffset>0x584</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.98</name>
        <addressOffset>0x588</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.99</name>
        <addressOffset>0x58c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.100</name>
        <addressOffset>0x590</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.101</name>
        <addressOffset>0x594</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.102</name>
        <addressOffset>0x598</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.103</name>
        <addressOffset>0x59c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.104</name>
        <addressOffset>0x5a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.105</name>
        <addressOffset>0x5a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.106</name>
        <addressOffset>0x5a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.107</name>
        <addressOffset>0x5ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.108</name>
        <addressOffset>0x5b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.109</name>
        <addressOffset>0x5b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.110</name>
        <addressOffset>0x5b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.111</name>
        <addressOffset>0x5bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.112</name>
        <addressOffset>0x5c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.113</name>
        <addressOffset>0x5c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.114</name>
        <addressOffset>0x5c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.115</name>
        <addressOffset>0x5cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.116</name>
        <addressOffset>0x5d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.117</name>
        <addressOffset>0x5d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.118</name>
        <addressOffset>0x5d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.119</name>
        <addressOffset>0x5dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.120</name>
        <addressOffset>0x5e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.121</name>
        <addressOffset>0x5e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.122</name>
        <addressOffset>0x5e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.123</name>
        <addressOffset>0x5ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.124</name>
        <addressOffset>0x5f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.125</name>
        <addressOffset>0x5f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.126</name>
        <addressOffset>0x5f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.127</name>
        <addressOffset>0x5fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.128</name>
        <addressOffset>0x600</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.129</name>
        <addressOffset>0x604</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.130</name>
        <addressOffset>0x608</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.131</name>
        <addressOffset>0x60c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.132</name>
        <addressOffset>0x610</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.133</name>
        <addressOffset>0x614</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.134</name>
        <addressOffset>0x618</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.135</name>
        <addressOffset>0x61c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.136</name>
        <addressOffset>0x620</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.137</name>
        <addressOffset>0x624</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.138</name>
        <addressOffset>0x628</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.139</name>
        <addressOffset>0x62c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.140</name>
        <addressOffset>0x630</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.141</name>
        <addressOffset>0x634</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.142</name>
        <addressOffset>0x638</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.143</name>
        <addressOffset>0x63c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.144</name>
        <addressOffset>0x640</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.145</name>
        <addressOffset>0x644</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.146</name>
        <addressOffset>0x648</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.147</name>
        <addressOffset>0x64c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.148</name>
        <addressOffset>0x650</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.149</name>
        <addressOffset>0x654</addressOffset>
        <size>0x20</size>
      </register>
